In [1]:
# pandas 处理一维数据 和 二维数据

In [2]:
import pandas as pd

In [11]:
s = pd.Series([2,3,4,5,6,8,7,5,4,3,3,45,5,7,8])  # 将Python的列表[]转换成pandas的Series对象
print(s)

0      2
1      3
2      4
3      5
4      6
5      8
6      7
7      5
8      4
9      3
10     3
11    45
12     5
13     7
14     8
dtype: int64

In [15]:
s[s.__len__()-1]

8

In [16]:
type(s)

pandas.core.series.Series

In [19]:
import pandas as pd
data = {"name":["张三", "李四", "王五"] , "age":[19,26,30], "sex":["男", "女", "女"]}
df = pd.DataFrame(data)
print(df)

  name  age sex
0   张三   19   男
1   李四   26   女
2   王五   30   女

In [20]:
type(df)

pandas.core.frame.DataFrame

## pandas.core.frame.DataFrame   pandas.core.series.Series

In [25]:
df['name']

0    张三
1    李四
2    王五
Name: name, dtype: object

In [27]:
df['name'][2]

'王五'

In [22]:
df['age']

0    19
1    26
2    30
Name: age, dtype: int64

In [24]:
n = df['name']
type(n)

pandas.core.series.Series

In [29]:
# pandas 读写文件
# 写文件是DataFrame对象的API
# 读文件是pandas的API

In [32]:
# write
import pandas as pd
data = {"name":["张三", "李四", "王五"] , "age":[19,26,30], "sex":["男", "女", "女"]}
df = pd.DataFrame(data)
df.to_csv('1.csv', index = True)

In [33]:
# read
import pandas as pd
df_csv = pd.read_csv('1.csv')
df_csv

   Unnamed: 0 name  age sex
0           0   张三   19   男
1           1   李四   26   女
2           2   王五   30   女

In [34]:
df

  name  age sex
0   张三   19   男
1   李四   26   女
2   王五   30   女

In [35]:
# write
import pandas as pd
data = {"name":["张三", "李四", "王五"] , "age":[19,26,30], "sex":["男", "女", "女"]}
df = pd.DataFrame(data)
df.to_csv('2.csv', index = False) # index=false去掉行索引号

df_csv2 = pd.read_csv('2.csv')
df_csv2

  name  age sex
0   张三   19   男
1   李四   26   女
2   王五   30   女

In [38]:
# 将df写到excel中 1.xlsx 1.xls ，不要行索引
# 将1.xlsx的数据读取出来
df.to_excel('1.xlsx',index=False)
df_excel = pd.read_excel('1.xlsx')
df_excel

  name  age sex
0   张三   19   男
1   李四   26   女
2   王五   30   女

# pandas处理时间

In [39]:
import pandas as pd
times = pd.date_range('14/3/2023',periods=24, freq='H')
print(times)

DatetimeIndex(['2023-03-14 00:00:00', '2023-03-14 01:00:00',
               '2023-03-14 02:00:00', '2023-03-14 03:00:00',
               '2023-03-14 04:00:00', '2023-03-14 05:00:00',
               '2023-03-14 06:00:00', '2023-03-14 07:00:00',
               '2023-03-14 08:00:00', '2023-03-14 09:00:00',
               '2023-03-14 10:00:00', '2023-03-14 11:00:00',
               '2023-03-14 12:00:00', '2023-03-14 13:00:00',
               '2023-03-14 14:00:00', '2023-03-14 15:00:00',
               '2023-03-14 16:00:00', '2023-03-14 17:00:00',
               '2023-03-14 18:00:00', '2023-03-14 19:00:00',
               '2023-03-14 20:00:00', '2023-03-14 21:00:00',
               '2023-03-14 22:00:00', '2023-03-14 23:00:00'],
              dtype='datetime64[ns]', freq='H')

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8844\1950622201.py:2: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  times = pd.date_range('14/3/2023',periods=24, freq='H')

In [40]:
type(times)

pandas.core.indexes.datetimes.DatetimeIndex

In [41]:
data = {'ymd':times}
df = pd.DataFrame(data)
print(df)

                   ymd
0  2023-03-14 00:00:00
1  2023-03-14 01:00:00
2  2023-03-14 02:00:00
3  2023-03-14 03:00:00
4  2023-03-14 04:00:00
5  2023-03-14 05:00:00
6  2023-03-14 06:00:00
7  2023-03-14 07:00:00
8  2023-03-14 08:00:00
9  2023-03-14 09:00:00
10 2023-03-14 10:00:00
11 2023-03-14 11:00:00
12 2023-03-14 12:00:00
13 2023-03-14 13:00:00
14 2023-03-14 14:00:00
15 2023-03-14 15:00:00
16 2023-03-14 16:00:00
17 2023-03-14 17:00:00
18 2023-03-14 18:00:00
19 2023-03-14 19:00:00
20 2023-03-14 20:00:00
21 2023-03-14 21:00:00
22 2023-03-14 22:00:00
23 2023-03-14 23:00:00

In [42]:
df['ymd'].max() # 最大值

Timestamp('2023-03-14 23:00:00')

In [43]:
df['ymd'].min()

Timestamp('2023-03-14 00:00:00')

In [47]:
ts = df['ymd'][22]
print("年", ts.year)
print("分钟", ts.minute)
print("秒", ts.second)
# 月 天day 时hour 分 秒

年 2023
分钟 0
分钟 0

In [48]:
import pandas as pd
strtime = "2023 3 10 11:25:39" # 字符串
t = pd.to_datetime(strtime)
print(t)

2023-03-10 11:25:39

In [49]:
type(t)

pandas._libs.tslibs.timestamps.Timestamp

In [51]:
print(t.year, t.second)

2023 39

In [68]:
import pandas as pd
strtime1 = '1990 2 20 11:35:30' # 字符串
strtime2 = '2023 3 14 8:43:55' # 字符串
t1 = pd.to_datetime(strtime1) # pandas._libs.tslibs.timestamps.Timestamp
t2 = pd.to_datetime(strtime2) # pandas._libs.tslibs.timestamps.Timestamp
print(t2 - t1) # class 'pandas._libs.tslibs.timedeltas.Timedelta

12074 days 21:08:25

In [70]:
time_diff = t2 - t1
print(type(time_diff))

<class 'pandas._libs.tslibs.timedeltas.Timedelta'>

In [72]:
time_diff.total_seconds()

1043269705.0

In [83]:
import pandas as pd
times = pd.date_range('14/3/2023',periods=100, freq='D')  # Y M D H
data = {'ymd':times}
df = pd.DataFrame(data)
df.to_csv('time.csv',index=False)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8844\1277782380.py:2: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  times = pd.date_range('14/3/2023',periods=100, freq='D')  # Y M D H

In [90]:
df_time = pd.read_csv('time.csv')
ts = pd.to_datetime(df_time['ymd'][1])
print(ts.year, ts.month)

2023 3

In [96]:
# 读取time.xlsx
import pandas as pd
df = pd.read_excel('time.xlsx', sheet_name='Sheet2')
df

       name                date
0  zhangsan  15/3/2000 11:20:30
1      lisi  16/3/2000 10:20:31
2    wangwu  15/2/2000 11:20:32

In [98]:
# 张三和李四的出生日期差了多少秒 total_seconds
tzs = pd.to_datetime(df['date'][0]) # 张三的出生日期
tls = pd.to_datetime(df['date'][1])
print(tzs,tls)
print(type(tzs))

2000-03-15 11:20:30 2000-03-16 10:20:31
<class 'pandas._libs.tslibs.timestamps.Timestamp'>

In [101]:
print(tls - tzs)
print(type(tls - tzs))

0 days 23:00:01
<class 'pandas._libs.tslibs.timedeltas.Timedelta'>

In [102]:
tdelta = tls - tzs
print(tdelta.total_seconds())

82801.0

In [103]:
import pandas as pd
tzs = pd.to_datetime(df['date'][0]) # 张三的出生日期
tls = pd.to_datetime(df['date'][1])
tdelta = tls - tzs
print(tdelta.total_seconds())

82801.0

In [111]:
# pandas 对数据进行分组
import pandas as pd
data = {"name":["张三","李四","王五","赵柳","陈器","王八"],
        "age":[19,20,21,30,17,22],
        "sex":["female","female","male","female","female","male"]
       }
df = pd.DataFrame(data)
df

  name  age     sex
0   张三   19  female
1   李四   20  female
2   王五   21    male
3   赵柳   30  female
4   陈器   17  female
5   王八   22    male

In [112]:
# 分组
s = df.groupby("sex")
print(s) # DataFrameGroupBy

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002825C725090>

In [113]:
s.count()

        name  age
sex
female     4    4
male       2    2

In [114]:
s['name'].count()

sex
female    4
male      2
Name: name, dtype: int64

In [115]:
s['age'].count()

sex
female    4
male      2
Name: age, dtype: int64

In [116]:
import pandas as pd
df = pd.read_excel("students.xlsx",sheet_name="s1")
df

            id name profession   class
0    200401176  王子文       软件技术  20软件5班
1    200401177   杨鑫       软件技术  20软件5班
2    200401178  张正昊       软件技术  20软件5班
3    200401179   舒煜       软件技术  20软件5班
4    200401180  温佳豪       软件技术  20软件5班
..         ...  ...        ...     ...
128  200401303   杨桂       软件技术  20软件7班
129  200401304  阮程双       软件技术  20软件7班
130  200401305  罗兰兰       软件技术  20软件7班
131  200401306  桂秋慧       软件技术  20软件7班
132  200401307  张雨婷       软件技术  20软件7班

[133 rows x 4 columns]

In [119]:
s = df.groupby('class') # select count(name) from studnets groupby class
s.count()

        id  name  profession
class
20软件5班  44    44          44
20软件6班  45    45          45
20软件7班  44    44          44

In [122]:
s['id'].count()

class
20软件5班    44
20软件6班    45
20软件7班    44
Name: id, dtype: int64

In [125]:
# pandas 对数据进行分组
import pandas as pd
data = {"name":["张三","李四","王五","赵柳","陈器","王八"],
        "age":[19,20,21,30,17,22],
        "sex":["female","female","male","female","female","male"]
       }
df = pd.DataFrame(data)
# 按照性别进行分组
s = df.groupby('sex')

# 获取female分组
fm = s.get_group('female')
fm

  name  age     sex
0   张三   19  female
1   李四   20  female
3   赵柳   30  female
4   陈器   17  female

In [152]:
# pandas 对数据进行分组
import pandas as pd
data = {"name":["张三","李四","王五","赵柳","陈器","王八"],
        "age":[19,20,21,30,17,22],
        "sex":["female","female","male","female","female","male"]
       }
df = pd.DataFrame(data)
# 按照性别进行分组
s = df.groupby('sex')

# 获取male分组
fm = s.get_group('male')
fm

  name  age   sex
2   王五   21  male
5   王八   22  male

In [153]:
# 聚合
import pandas as pd
data1 = {"name":["张三1","李四1","王五1","赵柳1","陈器1","王八1"],
        "age":[19,20,21,30,17,22],
        "sex":["female","female","male","female","female","male"]
       }
data2 = {"name":["张三2","李四2","王五2","赵柳2","陈器2","王八1"],
        "age":[29,17,21,31,18,22],
        "sex":["female","female","fmale","female","female","male"]
       }
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [154]:
df1

  name  age     sex
0  张三1   19  female
1  李四1   20  female
2  王五1   21    male
3  赵柳1   30  female
4  陈器1   17  female
5  王八1   22    male

In [155]:
df2

  name  age     sex
0  张三2   29  female
1  李四2   17  female
2  王五2   21   fmale
3  赵柳2   31  female
4  陈器2   18  female
5  王八1   22    male

In [156]:
pd.concat(df1,df2) # 参数错误

C:\Users\Administrator\AppData\Local\Temp\ipykernel_8844\1546744412.py:1: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only.
  pd.concat(df1,df2) # 参数错误

TypeError: first argument must be an iterable of pandas objects, you passed an object of type "DataFrame"

In [157]:
pd.concat([df1,df2])

  name  age     sex
0  张三1   19  female
1  李四1   20  female
2  王五1   21    male
3  赵柳1   30  female
4  陈器1   17  female
5  王八1   22    male
0  张三2   29  female
1  李四2   17  female
2  王五2   21   fmale
3  赵柳2   31  female
4  陈器2   18  female
5  王八1   22    male

In [158]:
pd.concat([df1,df2],ignore_index=True)  # ignore_index=True忽略默认索引，重新添加索引

   name  age     sex
0   张三1   19  female
1   李四1   20  female
2   王五1   21    male
3   赵柳1   30  female
4   陈器1   17  female
5   王八1   22    male
6   张三2   29  female
7   李四2   17  female
8   王五2   21   fmale
9   赵柳2   31  female
10  陈器2   18  female
11  王八1   22    male

In [159]:
df = pd.concat([df1,df2],ignore_index=True)
df.drop_duplicates() # 去掉重复,对df没有影响

   name  age     sex
0   张三1   19  female
1   李四1   20  female
2   王五1   21    male
3   赵柳1   30  female
4   陈器1   17  female
5   王八1   22    male
6   张三2   29  female
7   李四2   17  female
8   王五2   21   fmale
9   赵柳2   31  female
10  陈器2   18  female

In [162]:
# merge 合并
import pandas as pd
data1 = {"name":["tom","jerry", "nicholas"], "age":[10,5,20]}
data2 = {"name":["tom","jerry", "nicholas", "jackma"], "sex":["female","male","male","male"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [163]:
df1

       name  age
0       tom   10
1     jerry    5
2  nicholas   20

In [164]:
df2

       name     sex
0       tom  female
1     jerry    male
2  nicholas    male
3    jackma    male

In [165]:
pd.merge(df1,df2) # pd.concat([df1,df2])

       name  age     sex
0       tom   10  female
1     jerry    5    male
2  nicholas   20    male

In [169]:
# 合并students.xlsx 中的 s1和s2
df1 = pd.read_excel('students.xlsx',sheet_name='s1')
df2 = pd.read_excel('students.xlsx',sheet_name='s2')
pd.merge(df1,df2)

            id name profession   class  grade memo
0    200401176  王子文       软件技术  20软件5班    100  NaN
1    200401177   杨鑫       软件技术  20软件5班     90  NaN
2    200401178  张正昊       软件技术  20软件5班     91  NaN
3    200401179   舒煜       软件技术  20软件5班     85  NaN
4    200401180  温佳豪       软件技术  20软件5班     63  NaN
..         ...  ...        ...     ...    ...  ...
128  200401303   杨桂       软件技术  20软件7班     69  NaN
129  200401304  阮程双       软件技术  20软件7班     77  NaN
130  200401305  罗兰兰       软件技术  20软件7班     85  NaN
131  200401306  桂秋慧       软件技术  20软件7班     93  NaN
132  200401307  张雨婷       软件技术  20软件7班     61  NaN

[133 rows x 6 columns]

In [173]:
# merge 合并
import pandas as pd
data1 = {"name":["tom","jerry", "nicholas"], "age":[10,5,20]}
data2 = {"name":["tom","jerry", "nicholas", "jackma"], "sex":["female","male","male","male"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
pd.merge(df1,df2)

       name  age     sex
0       tom   10  female
1     jerry    5    male
2  nicholas   20    male

In [174]:
pd.concat([df1,df2]) # 类似数据库的全连接full join

       name   age     sex
0       tom  10.0     NaN
1     jerry   5.0     NaN
2  nicholas  20.0     NaN
0       tom   NaN  female
1     jerry   NaN    male
2  nicholas   NaN    male
3    jackma   NaN    male

In [177]:
# merge 合并 指定 how
import pandas as pd
data1 = {"name":["tom","jerry", "nicholas"], "age":[10,5,20]}
data2 = {"name":["tom","jerry", "nicholas", "jackma"], "sex":["female","male","male","male"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
pd.merge(df1,df2,how="outer")

       name   age     sex
0       tom  10.0  female
1     jerry   5.0    male
2  nicholas  20.0    male
3    jackma   NaN    male

In [178]:
# merge 合并 指定 how
import pandas as pd
data1 = {"name":["tom","jerry", "nicholas"], "age":[10,5,20]}
data2 = {"name":["tom","jerry", "nicholas", "jackma"], "sex":["female","male","male","male"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
pd.merge(df1,df2,how="left") # 以左边的表df1为准进行合并

       name  age     sex
0       tom   10  female
1     jerry    5    male
2  nicholas   20    male

In [179]:
# merge 合并 指定 how
import pandas as pd
data1 = {"name":["tom","jerry", "nicholas"], "age":[10,5,20]}
data2 = {"name":["tom","jerry", "nicholas", "jackma"], "sex":["female","male","male","male"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
pd.merge(df1,df2,how="right") # 以右边的表df2为准进行合并

       name   age     sex
0       tom  10.0  female
1     jerry   5.0    male
2  nicholas  20.0    male
3    jackma   NaN    male

In [182]:
# merge 合并 指定 how
import pandas as pd
data1 = {"name":["tom","jerry", "nicholas"], "age":[10,5,20]}
data2 = {"name":["tom","jerry", "nicholas", "jackma"], "sex":["female","male","male","male"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
pd.merge(df1,df2,how="inner") # 内，取共同的数据

       name  age     sex
0       tom   10  female
1     jerry    5    male
2  nicholas   20    male

In [251]:
import pandas as pd
data1 = {"A":["A1","A2","A3"]}
data2 = {"B":["B1","B2"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1.join(df2)  # 看看是什么意思，理解就行。 将A和B从左边到右边合并

    A    B
0  A1   B1
1  A2   B2
2  A3  NaN

In [254]:
# data1多出一行
import pandas as pd
data1 = {"A":["A1","A2","A3","A4"]} # data1多出一行
data2 = {"B":["B1","B2"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1.join(df2)

    A    B
0  A1   B1
1  A2   B2
2  A3  NaN
3  A4  NaN

In [256]:
# data1 data2的列名一样，报错
import pandas as pd
data1 = {"A":["A1","A2","A3"]} # data1多出一行
data2 = {"A":["B1","B2"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['A'], dtype='object')

In [202]:
# 获取年龄大于 小于 等于 某个值
import pandas as pd
data1 = {"name":["tom","jerry", "nicholas"], "age":[10,5,20]}
data2 = {"name":["tom","jerry", "nicholas", "jackma"], "sex":["female","male","male","male"]}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df = pd.merge(df1,df2,on="name") # 以共同的字段name进行merge
df[df['age']<20]

    name  age     sex
0    tom   10  female
1  jerry    5    male

In [ ]:
# 作业：
作业：
	1 用pandas读取 students.xlsx中 s1 s2 这两个sheet页的数据，生成两个DataFrame对象 df1 df2
	2 把df1 df2 连接到一起 merge 【concat join】 ,效果如下

效果
200401176	王子文	软件技术	20软件5班  100  
200401177	杨鑫	软件技术	20软件5班   0    缺考
200401178	张正昊	软件技术	20软件5班

	3 求【所有】成绩的平均值 最大值 最小值 标准差  mean max min std
	  求【20软件7班】成绩的平均值 最大值 最小值 标准差  mean max min std  【说明：就是对表格数据进行分组 df.groupby("class")】
        取出【20软件5班】成绩大于60分的所有学生的信息

	4 https://pandas.pydata.org/docs/getting_started/intro_tutorials/01_table_oriented.html
		任选一段话，翻译一下

In [204]:
# 作业答案
import pandas as pd
df1 = pd.read_excel('students.xlsx',sheet_name="s1")
df2 = pd.read_excel('students.xlsx',sheet_name="s2")

In [212]:
df = df1.merge(df2,on='id')

In [218]:
print(df['grade'].max(), df['grade'].min(),df['grade'].mean(), df['grade'].std())

100 0 75.76691729323308 16.81804911489399

In [233]:
df7 = df.groupby('class').get_group('20软件7班')
print(df7['grade'].max(), df7['grade'].min(),df7['grade'].mean(), df7['grade'].std())

93 0 73.75 16.659552745329588

In [246]:
df5 = df.groupby('class').get_group('20软件5班')
df5[df5['grade']>90]

           id name profession   class  grade memo
0   200401176  王子文       软件技术  20软件5班    100  NaN
2   200401178  张正昊       软件技术  20软件5班     91  NaN
8   200401184   张骏       软件技术  20软件5班     91  NaN
63  200401187  刘一凡       软件技术  20软件5班     93  NaN
68  200401192  胡俊飞       软件技术  20软件5班     93  NaN
73  200401197  肖君霖       软件技术  20软件5班     93  NaN
78  200401202  皮付贵       软件技术  20软件5班     93  NaN
83  200401207  谢鄂赣       软件技术  20软件5班     93  NaN
84  200401208  彭庆坤       软件技术  20软件5班     93  NaN
89  200401213  刘宇佳       软件技术  20软件5班     93  NaN
94  200401218   阙姗       软件技术  20软件5班     93  NaN